#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.messages_eventhub.module.messages-evh.azurerm_eventhub.events["io-p-itn-com-elt-io-p-italynorth-com-messages-evh-01-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-elt-io-p-italynorth-com-messages-evh-01-01"
      + namespace_name      = "io-p-itn-com-elt-evhns-01"
      + partition_count     = 32
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.messages_eventhub.module.messages-evh.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-elt-io-p-italynorth-com-messages-evh-01-01.io-messages"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-elt-io-p-italynorth-com-messages-evh-01-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-messages"
      + namespace_name                    = "io-p-itn-com-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.messages_eventhub.module.messages-evh.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-elt-io-p-italynorth-com-messages-evh-01-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-elt-io-p-italynorth-com-messages-evh-01-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-com-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.messages_eventhub.module.messages-evh.azurerm_eventhub_namespace.this will be created
  + resource "azurerm_eventhub_namespace" "this" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "italynorth"
      + minimum_tls_version                       = (known after apply)
      + name                                      = "io-p-itn-com-elt-evhns-01"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = false
      + resource_group_name                       = "io-p-itn-com-rg-01"
      + sku                                       = "Standard"
      + tags                                      = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + zone_redundant                            = false
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.redis_messages.azurerm_redis_cache.this,
  on .terraform/modules/redis_messages/redis_cache/main.tf line 7, in resource "azurerm_redis_cache" "this":
   7:   enable_non_ssl_port           = var.enable_non_ssl_port

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and 7 more similar warnings elsewhere)

Error: parsing "io-p-itn-pep-snet-01": parsing the Subnet ID: the number of segments didn't match

Expected a Subnet ID that matched (containing 10 segments):

> /subscriptions/12345678-1234-9876-4563-123456789012/resourceGroups/example-resource-group/providers/Microsoft.Network/virtualNetworks/virtualNetworksValue/subnets/subnetValue

However this value was provided (which was parsed into 0 segments):

> io-p-itn-pep-snet-01

The following Segments are expected:

* Segment 0 - this should be the literal value "subscriptions"
* Segment 1 - this should be the UUID of the Azure Subscription
* Segment 2 - this should be the literal value "resourceGroups"
* Segment 3 - this should be the name of the Resource Group
* Segment 4 - this should be the literal value "providers"
* Segment 5 - this should be the name of the Resource Provider [for example 'Microsoft.Network']
* Segment 6 - this should be the literal value "virtualNetworks"
* Segment 7 - this should be the user specified value for this virtualNetwork [for example "virtualNetworksValue"]
* Segment 8 - this should be the literal value "subnets"
* Segment 9 - this should be the user specified value for this subnet [for example "subnetValue"]

The following Segments were parsed:

* Segment 0 - not found
* Segment 1 - not found
* Segment 2 - not found
* Segment 3 - not found
* Segment 4 - not found
* Segment 5 - not found
* Segment 6 - not found
* Segment 7 - not found
* Segment 8 - not found
* Segment 9 - not found


  with module.messages_eventhub.module.messages-evh.azurerm_private_endpoint.event_hub_pep,
  on .terraform/modules/messages_eventhub.messages-evh/infra/modules/azure_event_hub/network.tf line 5, in resource "azurerm_private_endpoint" "event_hub_pep":
   5:   subnet_id           = var.subnet_pep_id

::error::Terraform exited with code 1.
```

</details>
